export const tagOptions = [
  {
    value: "วิชาการ",
    label: "วิชาการ",
    image: "/assets/images/tags-pic/academic.jpg",
  },
  {
    value: "วิชาชีพ",
    label: "วิชาชีพ",
    image: "/assets/images/tags-pic/career.jpg",
  },
  {
    value: "กิจการนักศึกษา",
    label: "กิจการนักศึกษา",
    image: "/assets/images/tags-pic/event_std.jpg",
  },
  {
    value: "เทคโนโลยี",
    label: "เทคโนโลยี",
    image: "/assets/images/tags-pic/tech.jpg",
  },
  {
    value: "การพัฒนาตนเอง",
    label: "การพัฒนาตนเอง",
    image: "/assets/images/tags-pic/upskill.png",
  },
  {
    value: "บันเทิงและเกม",
    label: "บันเทิงและเกม",
    image: "/assets/images/tags-pic/entertain.jpg",
  },
  {
    value: "ศิลปะและวัฒนธรรม",
    label: "ศิลปะและวัฒนธรรม",
    image: "/assets/images/tags-pic/art.jpg",
  },
  {
    value: "สุขภาพและกีฬา",
    label: "สุขภาพและกีฬา",
    image: "/assets/images/tags-pic/health.jpg",
  },
  {
    value: "เข้าสังคม",
    label: "เข้าสังคม",
    image: "/assets/images/tags-pic/social.jpg",
  },
  {
    value: "จิตอาสาและศาสนา",
    label: "จิตอาสาและศาสนา",
    image: "/assets/images/tags-pic/volunteer.jpg",
  },
];

export const departmentOptions = [
  { value: "ทุกคณะ", label: "ทุกคณะ" },
  { value: "คณะมนุษยศาสตร์", label: "คณะมนุษยศาสตร์" },
  { value: "คณะศึกษาศาสตร์", label: "คณะศึกษาศาสตร์" },
  { value: "คณะวิจิตรศิลป์", label: "คณะวิจิตรศิลป์" },
  { value: "คณะสังคมศาสตร์", label: "คณะสังคมศาสตร์" },
  { value: "คณะวิทยาศาสตร์", label: "คณะวิทยาศาสตร์" },
  { value: "คณะวิศวกรรมศาสตร์", label: "คณะวิศวกรรมศาสตร์" },
  { value: "คณะแพทยศาสตร์", label: "คณะแพทยศาสตร์" },
  { value: "คณะเกษตรศาสตร์", label: "คณะเกษตรศาสตร์" },
  { value: "คณะทันตแพทยศาสตร์", label: "คณะทันตแพทยศาสตร์" },
  { value: "คณะเภสัชศาสตร์", label: "คณะเภสัชศาสตร์" },
  { value: "คณะเทคนิคการแพทย์", label: "คณะเทคนิคการแพทย์" },
  // { value: "คณะเภสัชศาสตร์", label: "คณะเภสัชศาสตร์" },
  // { value: "คณะทันตแพทยศาสตร์", label: "คณะทันตแพทยศาสตร์" },
  { value: "คณะพยาบาลศาสตร์", label: "คณะพยาบาลศาสตร์" },
  { value: "คณะอุตสาหกรรมเกษตร", label: "คณะอุตสาหกรรมเกษตร" },
  { value: "คณะสัตวแพทยศาสตร์", label: "คณะสัตวแพทยศาสตร์" },
  { value: "คณะบริหารธุรกิจ", label: "คณะบริหารธุรกิจ" },
  { value: "คณะเศรษฐศาสตร์", label: "คณะเศรษฐศาสตร์" },
  { value: "คณะสถาปัตยกรรมศาสตร์", label: "คณะสถาปัตยกรรมศาสตร์" },
  { value: "คณะการสื่อสารมวลชน", label: "คณะการสื่อสารมวลชน" },
  {
    value: "คณะรัฐศาสตร์และรัฐประศาสนศาสตร์",
    label: "คณะรัฐศาสตร์และรัฐประศาสนศาสตร์",
  },
  { value: "คณะนิติศาสตร์", label: "คณะนิติศาสตร์" },
  {
    value: "วิทยาลัยศิลปะ สื่อ และเทคโนโลยี",
    label: "วิทยาลัยศิลปะ สื่อ และเทคโนโลยี",
  },
  { value: "คณะสาธารณสุขศาสตร์", label: "คณะสาธารณสุขศาสตร์" },
  {
    value: "วิทยาลัยการศึกษาและการจัดการทางทะเล",
    label: "วิทยาลัยการศึกษาและการจัดการทางทะเล",
  },
  {
    value: "วิทยาลัยนานาชาตินวัตกรรมดิจิทัล",
    label: "วิทยาลัยนานาชาตินวัตกรรมดิจิทัล",
  },
  { value: "สถาบันนโยบายสาธารณะ", label: "สถาบันนโยบายสาธารณะ" },
  { value: "สถาบันวิศวกรรมชีวการแพทย์", label: "สถาบันวิศวกรรมชีวการแพทย์" },
  {
    value: "สถาบันวิจัยวิทยาศาสตร์กีฬา",
    label: "สถาบันวิจัยวิทยาศาสตร์สุขภาพ",
  },
  { value: "บัณฑิตวิทยาลัย", label: "บัณฑิตวิทยาลัย" },
];

